In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [3]:
#Read data
df=pd.read_csv("Salaries.csv")

C:\Users\User\AppData\Local\Temp\ipykernel_15356\527640754.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("Salaries.csv")

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [5]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [6]:
df.describe(include='object')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,Agency,Status
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654,38119
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,1,2
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,San Francisco,FT
freq,13,7036,875.0,66103.0,35218.0,1053.0,148654,22334

In [7]:
#num of null values
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [8]:
df.isnull().mean()*100

Id                    0.000000
EmployeeName          0.000000
JobTitle              0.000000
BasePay               0.406985
OvertimePay           0.000000
OtherPay              0.000000
Benefits             24.324270
TotalPay              0.000000
TotalPayBenefits      0.000000
Year                  0.000000
Notes               100.000000
Agency                0.000000
Status               74.357232
dtype: float64

In [9]:
#null but with percentages
round(df.isnull().sum()/df.shape[0],3)*100

Id                    0.0
EmployeeName          0.0
JobTitle              0.0
BasePay               0.4
OvertimePay           0.0
OtherPay              0.0
Benefits             24.3
TotalPay              0.0
TotalPayBenefits      0.0
Year                  0.0
Notes               100.0
Agency                0.0
Status               74.4
dtype: float64

In [10]:
df['Status'].mode()

0    FT
Name: Status, dtype: object

In [11]:
df.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601.0,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

In [12]:
df.shape

(148654, 13)

In [13]:
#drop Id column to identify duolicates
df.drop(columns=["Id"],inplace=True)

In [14]:
df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [15]:
#Fined dublicates
df.duplicated().sum()

3

In [16]:
#display duplicate rows
df[df.duplicated()]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148650,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN

In [17]:
#drop duplicates rows beacause of did not have any important information
df.drop_duplicates(inplace=True)

In [18]:
df.duplicated().sum()

0

In [19]:
df[:3]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [20]:
df.describe()

            TotalPay  TotalPayBenefits           Year  Notes
count  148651.000000     148651.000000  148651.000000    0.0
mean    74769.830909      93694.445667    2012.522613    NaN
std     50516.398338      62792.756431       1.117529    NaN
min      -618.130000       -618.130000    2011.000000    NaN
25%     36169.340000      44071.405000    2012.000000    NaN
50%     71427.220000      92406.010000    2013.000000    NaN
75%    105841.940000     132877.495000    2014.000000    NaN
max    567595.430000     567595.430000    2014.000000    NaN

Handel Mix Data Types

In [21]:
#df['BasePay']=df['BasePay'].str.replace('Not provided','0').astype(float)

In [22]:
df['BasePay']=pd.to_numeric(df['BasePay'],errors="coerce") #coerce convert any string to nan
df['OvertimePay']=pd.to_numeric(df['OvertimePay'],errors="coerce")
df['OtherPay']=pd.to_numeric(df['OtherPay'],errors="coerce")
df['TotalPay']=pd.to_numeric(df['TotalPay'],errors="coerce")
df['Benefits']=pd.to_numeric(df['Benefits'],errors="coerce")

In [23]:
df.isnull().sum()

EmployeeName             0
JobTitle                 0
BasePay                606
OvertimePay              1
OtherPay                 1
Benefits             36160
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148651
Agency                   0
Status              110532
dtype: int64

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148651 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148651 non-null  object
 1   JobTitle          148651 non-null  object
 2   BasePay           148045 non-null  float64
 3   OvertimePay       148650 non-null  float64
 4   OtherPay          148650 non-null  float64
 5   Benefits          112491 non-null  float64
 6   TotalPay          148651 non-null  float64
 7   TotalPayBenefits  148651 non-null  float64
 8   Year              148651 non-null  int64
 9   Notes             0 non-null       float64
 10  Agency            148651 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(7), int64(1), object(4)
memory usage: 14.7+ MB

In [25]:
df.drop(columns=['Notes'],inplace=True)

In [26]:
df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,San Francisco,NaN
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco,NaN
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,San Francisco,NaN
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,San Francisco,NaN
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...
148646,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,San Francisco,NaN
148647,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.0,0.00,0.00,2014,San Francisco,PT
148648,Leon Walker,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,San Francisco,PT
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,San Francisco,PT
148653,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,San Francisco,PT

In [27]:
#see null values
df[(df["BasePay"].isnull() )& (df ["EmployeeName"]=='Not provided')]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
148646,Not provided,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014,San Francisco,NaN

In [28]:
df.drop(index=148646,inplace=True)

In [29]:
### Delete nulls and - 
df = df[df['BasePay']>=0]
df = df[df['OtherPay']>=0]
df = df[df['Benefits']>=0]
df = df[df['OvertimePay']>=0]

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 111868 entries, 36159 to 148649
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      111868 non-null  object
 1   JobTitle          111868 non-null  object
 2   BasePay           111868 non-null  float64
 3   OvertimePay       111868 non-null  float64
 4   OtherPay          111868 non-null  float64
 5   Benefits          111868 non-null  float64
 6   TotalPay          111868 non-null  float64
 7   TotalPayBenefits  111868 non-null  float64
 8   Year              111868 non-null  int64
 9   Agency            111868 non-null  object
 10  Status            38117 non-null   object
dtypes: float64(6), int64(1), object(4)
memory usage: 10.2+ MB

Negative values

In [31]:
#cllect all numeric columns to check if there is a negative values
float_col=df.select_dtypes(include=["float64","int64"]).columns

In [32]:
for i in float_col:
    print(df[i].min())

0.0
0.0
0.0
0.0
0.0
0.0
2012

In [33]:
[(i,df[i].min() )for i in float_col]

[('BasePay', 0.0),
 ('OvertimePay', 0.0),
 ('OtherPay', 0.0),
 ('Benefits', 0.0),
 ('TotalPay', 0.0),
 ('TotalPayBenefits', 0.0),
 ('Year', 2012)]

All negative values

In [34]:
df[(df['BasePay']<0) |(df['OvertimePay']<0 )|(df["OtherPay"]<0) |(df["TotalPay"]<0) | (df["TotalPayBenefits"]<0)]

Empty DataFrame
Columns: [EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year, Agency, Status]
Index: []

In [35]:
index_neg=[]
for i in float_col :
    print("name",i)
    display(df[df[i]<0][i])
    index_neg.append(df[df[i]<0][i].index)

name BasePay

Series([], Name: BasePay, dtype: float64)

name OvertimePay

Series([], Name: OvertimePay, dtype: float64)

name OtherPay

Series([], Name: OtherPay, dtype: float64)

name Benefits

Series([], Name: Benefits, dtype: float64)

name TotalPay

Series([], Name: TotalPay, dtype: float64)

name TotalPayBenefits

Series([], Name: TotalPayBenefits, dtype: float64)

name Year

Series([], Name: Year, dtype: int64)

In [36]:
print(index_neg)

[Int64Index([], dtype='int64'), Int64Index([], dtype='int64'), Int64Index([], dtype='int64'), Int64Index([], dtype='int64'), Int64Index([], dtype='int64'), Int64Index([], dtype='int64'), Int64Index([], dtype='int64')]

In [37]:
rows_to_drop = pd.concat([df[df[i] < 0] for i in float_col]).index

df = df.drop(rows_to_drop).reset_index(drop=True)

In [38]:
df.iloc[72832]

EmployeeName        Leah A Schillo
JobTitle             Special Nurse
BasePay                     1459.5
OvertimePay                    0.0
OtherPay                     29.19
Benefits                     14.89
TotalPay                   1488.69
TotalPayBenefits           1503.58
Year                          2013
Agency               San Francisco
Status                         NaN
Name: 72832, dtype: object

In [39]:
df.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay                 0
OvertimePay             0
OtherPay                0
Benefits                0
TotalPay                0
TotalPayBenefits        0
Year                    0
Agency                  0
Status              73751
dtype: int64

In [40]:
df.dropna(subset=["BasePay"],inplace=True)

In [41]:
df.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay                 0
OvertimePay             0
OtherPay                0
Benefits                0
TotalPay                0
TotalPayBenefits        0
Year                    0
Agency                  0
Status              73751
dtype: int64

median for every year

In [42]:
df.groupby(["Year"])['Benefits'].mean().sort_values()

Year
2013    24131.805491
2014    24790.902829
2012    26447.878767
Name: Benefits, dtype: float64

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111868 entries, 0 to 111867
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      111868 non-null  object
 1   JobTitle          111868 non-null  object
 2   BasePay           111868 non-null  float64
 3   OvertimePay       111868 non-null  float64
 4   OtherPay          111868 non-null  float64
 5   Benefits          111868 non-null  float64
 6   TotalPay          111868 non-null  float64
 7   TotalPayBenefits  111868 non-null  float64
 8   Year              111868 non-null  int64
 9   Agency            111868 non-null  object
 10  Status            38117 non-null   object
dtypes: float64(6), int64(1), object(4)
memory usage: 9.4+ MB

In [44]:

year2013=df[df["Year"]==2013]["Benefits"].median()

df.loc[:,"Benefits"]=df[df["Year"]==2013]["Benefits"].fillna(year2013)
df["Benefits"].fillna(df["Benefits"].median())

0         27343.18
1         27343.18
2         27343.18
3         27343.18
4         27343.18
            ...
111863    27343.18
111864    27343.18
111865    27343.18
111866    27343.18
111867    27343.18
Name: Benefits, Length: 111868, dtype: float64

Fill nan in Benefits with 0 beacause all null values in 2011 year

In [45]:
df[df["Year"]==2011]

df["Benefits"]=df["Benefits"].fillna(0)

In [46]:
df.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay                 0
OvertimePay             0
OtherPay                0
Benefits                0
TotalPay                0
TotalPayBenefits        0
Year                    0
Agency                  0
Status              73751
dtype: int64

In [47]:
df.drop(columns=["Status"],inplace=True)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111868 entries, 0 to 111867
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      111868 non-null  object
 1   JobTitle          111868 non-null  object
 2   BasePay           111868 non-null  float64
 3   OvertimePay       111868 non-null  float64
 4   OtherPay          111868 non-null  float64
 5   Benefits          111868 non-null  float64
 6   TotalPay          111868 non-null  float64
 7   TotalPayBenefits  111868 non-null  float64
 8   Year              111868 non-null  int64
 9   Agency            111868 non-null  object
dtypes: float64(6), int64(1), object(3)
memory usage: 8.5+ MB

In [49]:
df["Agency"].value_counts()

San Francisco    111868
Name: Agency, dtype: int64

In [50]:
df.drop(columns="Agency",inplace=True)

In [51]:
df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,Gary Altenberg,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,0.0,362844.66,407274.78,2012
1,Gregory Suhr,Chief of Police,302578.00,0.00,18974.11,0.0,321552.11,391362.30,2012
2,Khoa Trinh,Electronic Maintenance Tech,111921.00,146415.32,78057.41,0.0,336393.73,389496.02,2012
3,Joanne Hayes-White,"Chief, Fire Department",296943.01,0.00,17816.59,0.0,314759.60,386807.48,2012
4,Frederick Binkley,EMT/Paramedic/Firefighter,126863.19,192424.49,17917.18,0.0,337204.86,381643.11,2012
...,...,...,...,...,...,...,...,...,...
111863,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.0,0.00,0.00,2014
111864,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.0,0.00,0.00,2014
111865,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.0,0.00,0.00,2014
111866,Leon Walker,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014
111867,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014

In [52]:
#number of unique customers
df["EmployeeName"].nunique()

76425

In [53]:
148028-110301

37727

In [54]:
df.drop(columns="EmployeeName",inplace=True)

In [55]:
df

,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,0.0,362844.66,407274.78,2012
1,Chief of Police,302578.00,0.00,18974.11,0.0,321552.11,391362.30,2012
2,Electronic Maintenance Tech,111921.00,146415.32,78057.41,0.0,336393.73,389496.02,2012
3,"Chief, Fire Department",296943.01,0.00,17816.59,0.0,314759.60,386807.48,2012
4,EMT/Paramedic/Firefighter,126863.19,192424.49,17917.18,0.0,337204.86,381643.11,2012
...,...,...,...,...,...,...,...,...
111863,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.0,0.00,0.00,2014
111864,Human Services Technician,0.00,0.00,0.00,0.0,0.00,0.00,2014
111865,Communications Dispatcher 2,0.00,0.00,0.00,0.0,0.00,0.00,2014
111866,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014
111867,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014

In [56]:
#drop rows that have 0 in BasePay and OvertimePay and OtherPay and Benefits
zercol=["BasePay",'OvertimePay',"OtherPay","Benefits","TotalPay"]
rows_to_drop=df[(df["BasePay"]==0)& (df["OvertimePay"]==0)& (df["OtherPay"]==0) &(df["Benefits"]==0)&(df["TotalPay"]==0) &(df["TotalPayBenefits"]==0) ].index


df = df.drop(rows_to_drop).reset_index(drop=True)

In [57]:
df

,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,0.0,362844.66,407274.78,2012
1,Chief of Police,302578.00,0.00,18974.11,0.0,321552.11,391362.30,2012
2,Electronic Maintenance Tech,111921.00,146415.32,78057.41,0.0,336393.73,389496.02,2012
3,"Chief, Fire Department",296943.01,0.00,17816.59,0.0,314759.60,386807.48,2012
4,EMT/Paramedic/Firefighter,126863.19,192424.49,17917.18,0.0,337204.86,381643.11,2012
...,...,...,...,...,...,...,...,...
111840,Transit Operator,0.00,0.00,15.35,0.0,15.35,15.35,2014
111841,Senior Clerk,0.00,0.00,13.77,0.0,13.77,13.77,2014
111842,Attorney (Civil/Criminal),0.00,0.00,13.35,0.0,13.35,13.48,2014
111843,Senior Clerk,0.00,0.00,12.89,0.0,12.89,12.89,2014
111844,Registered Nurse,0.00,0.00,6.00,0.0,6.00,7.24,2014

EDA

In [58]:
df.groupby(["Year"])["TotalPay"].mean().sort_values()

Year
2012    74135.429698
2014    75521.120849
2013    78810.654705
Name: TotalPay, dtype: float64

high jop in data

In [59]:
maxbasepay=df["BasePay"].max()
df[df["BasePay"]==maxbasepay]

,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
36755,Chief of Police,319275.01,0.0,20007.06,86533.21,339282.07,425815.28,2013

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111845 entries, 0 to 111844
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   JobTitle          111845 non-null  object
 1   BasePay           111845 non-null  float64
 2   OvertimePay       111845 non-null  float64
 3   OtherPay          111845 non-null  float64
 4   Benefits          111845 non-null  float64
 5   TotalPay          111845 non-null  float64
 6   TotalPayBenefits  111845 non-null  float64
 7   Year              111845 non-null  int64
dtypes: float64(6), int64(1), object(1)
memory usage: 6.8+ MB